balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F66K22.PIC
        <edc:SFRDef edc:access="nnnnnnrn" edc:cname="TXSTA2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000010" edc:name="TXSTA2" edc:nzwidth="8" edc:por="00000010">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX9D" edc:desc="" edc:mask="0x1" edc:name="TX9D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX9" edc:desc="" edc:mask="0x1" edc:name="TX9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSRC" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TX9D2" edc:desc="" edc:mask="0x1" edc:name="TX9D2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT2" edc:desc="" edc:mask="0x1" edc:name="TRMT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH2" edc:desc="" edc:mask="0x1" edc:name="BRGH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SENDB2" edc:desc="" edc:mask="0x1" edc:name="SENDB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC2" edc:desc="" edc:mask="0x1" edc:name="SYNC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN2" edc:desc="" edc:mask="0x1" edc:name="TXEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX92" edc:desc="" edc:mask="0x1" edc:name="TX92" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC2" edc:desc="" edc:mask="0x1" edc:name="CSRC2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="RCSTA2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000x" edc:name="RCSTA2" edc:nzwidth="8" edc:por="0000000x">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RX9D2" edc:desc="" edc:mask="0x1" edc:name="RX9D2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR2" edc:desc="" edc:mask="0x1" edc:name="OERR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR2" edc:desc="" edc:mask="0x1" edc:name="FERR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN2" edc:desc="" edc:mask="0x1" edc:name="ADDEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN2" edc:desc="" edc:mask="0x1" edc:name="CREN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN2" edc:desc="" edc:mask="0x1" edc:name="SREN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX92" edc:desc="" edc:mask="0x1" edc:name="RX92" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN2" edc:desc="" edc:mask="0x1" edc:name="SPEN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="ANCON2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1111" edc:name="ANCON2" edc:nzwidth="8" edc:por="----1111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSEL16" edc:desc="" edc:mask="0x1" edc:name="ANSEL16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL17" edc:desc="" edc:mask="0x1" edc:name="ANSEL17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL18" edc:desc="" edc:mask="0x1" edc:name="ANSEL18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL19" edc:desc="" edc:mask="0x1" edc:name="ANSEL19" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="ANCON1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1111" edc:name="ANCON1" edc:nzwidth="8" edc:por="----1111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSEL8" edc:desc="" edc:mask="0x1" edc:name="ANSEL8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL9" edc:desc="" edc:mask="0x1" edc:name="ANSEL9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL10" edc:desc="" edc:mask="0x1" edc:name="ANSEL10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL11" edc:desc="" edc:mask="0x1" edc:name="ANSEL11" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANCON0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANCON0" edc:nzwidth="8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSEL0" edc:desc="" edc:mask="0x1" edc:name="ANSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL1" edc:desc="" edc:mask="0x1" edc:name="ANSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL2" edc:desc="" edc:mask="0x1" edc:name="ANSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL3" edc:desc="" edc:mask="0x1" edc:name="ANSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL4" edc:desc="" edc:mask="0x1" edc:name="ANSEL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL5" edc:desc="" edc:mask="0x1" edc:name="ANSEL5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL6" edc:desc="" edc:mask="0x1" edc:name="ANSEL6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL7" edc:desc="" edc:mask="0x1" edc:name="ANSEL7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nn-----n" edc:cname="ODCON3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-----0" edc:name="ODCON3" edc:nzwidth="8" edc:por="00-----0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTMUDS" edc:desc="" edc:mask="0x1" edc:name="CTMUDS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="U1OD" edc:desc="" edc:mask="0x1" edc:name="U1OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2OD" edc:desc="" edc:mask="0x1" edc:name="U2OD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCON2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCON2" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3OD" edc:desc="" edc:mask="0x1" edc:name="CCP3OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4OD" edc:desc="" edc:mask="0x1" edc:name="CCP4OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5OD" edc:desc="" edc:mask="0x1" edc:name="CCP5OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6OD" edc:desc="" edc:mask="0x1" edc:name="CCP6OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7OD" edc:desc="" edc:mask="0x1" edc:name="CCP7OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8OD" edc:desc="" edc:mask="0x1" edc:name="CCP8OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP9OD" edc:desc="" edc:mask="0x1" edc:name="CCP9OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10OD" edc:desc="" edc:mask="0x1" edc:name="CCP10OD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn----n" edc:cname="ODCON1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000----0" edc:name="ODCON1" edc:nzwidth="8" edc:por="000----0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI2OD" edc:desc="" edc:mask="0x1" edc:name="SPI2OD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP1OD" edc:desc="" edc:mask="0x1" edc:name="CCP1OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2OD" edc:desc="" edc:mask="0x1" edc:name="CCP2OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI1OD" edc:desc="" edc:mask="0x1" edc:name="SPI1OD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="REFOCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u-uuuuuu" edc:name="REFOCON" edc:nzwidth="8" edc:por="0-000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0xf" edc:name="RODIV" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0x1" edc:name="ROSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ROSSLP" edc:desc="" edc:mask="0x1" edc:name="ROSSLP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ROON" edc:desc="" edc:mask="0x1" edc:name="ROON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RODIV0" edc:desc="" edc:mask="0x1" edc:name="RODIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RODIV1" edc:desc="" edc:mask="0x1" edc:name="RODIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RODIV2" edc:desc="" edc:mask="0x1" edc:name="RODIV2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RODIV3" edc:desc="" edc:mask="0x1" edc:name="RODIV3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n-nnn" edc:cname="CCPTMRS2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---u-uuu" edc:name="CCPTMRS2" edc:nzwidth="8" edc:por="---0-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C8TSEL" edc:desc="" edc:mask="0x3" edc:name="C8TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C9TSEL0" edc:desc="" edc:mask="0x1" edc:name="C9TSEL0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C10TSEL0" edc:desc="" edc:mask="0x1" edc:name="C10TSEL0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C8TSEL0" edc:desc="" edc:mask="0x1" edc:name="C8TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8TSEL1" edc:desc="" edc:mask="0x1" edc:name="C8TSEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
