balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F66K22.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP2CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP2CON" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="ECCP2CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2M" edc:desc="" edc:mask="0xf" edc:name="CCP2M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC2B" edc:desc="" edc:mask="0x3" edc:name="DC2B" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P2M" edc:desc="" edc:mask="0x3" edc:name="P2M" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2M0" edc:desc="" edc:mask="0x1" edc:name="CCP2M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2M1" edc:desc="" edc:mask="0x1" edc:name="CCP2M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2M2" edc:desc="" edc:mask="0x1" edc:name="CCP2M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2M3" edc:desc="" edc:mask="0x1" edc:name="CCP2M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC2B0" edc:desc="" edc:mask="0x1" edc:name="DC2B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC2B1" edc:desc="" edc:mask="0x1" edc:name="DC2B1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2M0" edc:desc="" edc:mask="0x1" edc:name="P2M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2M1" edc:desc="" edc:mask="0x1" edc:name="P2M1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP2Y" edc:desc="" edc:mask="0x1" edc:name="CCP2Y" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2X" edc:desc="" edc:mask="0x1" edc:name="CCP2X" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR2" edc:desc="" edc:name="CCPR2" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR2L" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR2L" edc:desc="" edc:mask="0xff" edc:name="CCPR2L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2H" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR2H" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR2H" edc:desc="" edc:mask="0xff" edc:name="CCPR2H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP2DEL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP2DEL" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="PWM2CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P2DC" edc:desc="" edc:mask="0x7f" edc:name="P2DC" edc:nzwidth="7"/>
              <edc:SFRFieldDef edc:cname="P2RSEN" edc:desc="" edc:mask="0x1" edc:name="P2RSEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="P2DC0" edc:desc="" edc:mask="0x1" edc:name="P2DC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC1" edc:desc="" edc:mask="0x1" edc:name="P2DC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC2" edc:desc="" edc:mask="0x1" edc:name="P2DC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC3" edc:desc="" edc:mask="0x1" edc:name="P2DC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC4" edc:desc="" edc:mask="0x1" edc:name="P2DC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC5" edc:desc="" edc:mask="0x1" edc:name="P2DC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC6" edc:desc="" edc:mask="0x1" edc:name="P2DC6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP2AS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP2AS" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSS2BD" edc:desc="" edc:mask="0x3" edc:name="PSS2BD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS2AC" edc:desc="" edc:mask="0x3" edc:name="PSS2AC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ECCP2AS" edc:desc="" edc:mask="0x7" edc:name="ECCP2AS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ECCP2ASE" edc:desc="" edc:mask="0x1" edc:name="ECCP2ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSS2BD0" edc:desc="" edc:mask="0x1" edc:name="PSS2BD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS2BD1" edc:desc="" edc:mask="0x1" edc:name="PSS2BD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS2AC0" edc:desc="" edc:mask="0x1" edc:name="PSS2AC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS2AC1" edc:desc="" edc:mask="0x1" edc:name="PSS2AC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCP2AS0" edc:desc="" edc:mask="0x1" edc:name="ECCP2AS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCP2AS1" edc:desc="" edc:mask="0x1" edc:name="ECCP2AS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCP2AS2" edc:desc="" edc:mask="0x1" edc:name="ECCP2AS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---nn-" edc:cname="PADCFG1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---00-" edc:name="PADCFG1" edc:nzwidth="8" edc:por="00---00-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTSECSEL" edc:desc="" edc:mask="0x3" edc:name="RTSECSEL" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="REPU" edc:desc="" edc:mask="0x1" edc:name="REPU" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDPU" edc:desc="" edc:mask="0x1" edc:name="RDPU" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTSECSEL0" edc:desc="" edc:mask="0x1" edc:name="RTSECSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSECSEL1" edc:desc="" edc:mask="0x1" edc:name="RTSECSEL1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
