balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F66K22.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRG1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPBRG1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="SPBRG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPBRG1" edc:desc="" edc:mask="0xff" edc:name="SPBRG1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrnn" edc:cname="T3GCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuxuu" edc:name="T3GCON" edc:nzwidth="8" edc:por="00000x00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T3GSS" edc:desc="" edc:mask="0x3" edc:name="T3GSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="T3GVAL" edc:desc="" edc:mask="0x1" edc:name="T3GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GGO_nT3DONE" edc:desc="" edc:mask="0x1" edc:name="T3GGO_nT3DONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GSPM" edc:desc="" edc:mask="0x1" edc:name="T3GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GTM" edc:desc="" edc:mask="0x1" edc:name="T3GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GPOL" edc:desc="" edc:mask="0x1" edc:name="T3GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3GE" edc:desc="" edc:mask="0x1" edc:name="TMR3GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3GSS0" edc:desc="" edc:mask="0x1" edc:name="T3GSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GSS1" edc:desc="" edc:mask="0x1" edc:name="T3GSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T3GGO" edc:desc="" edc:mask="0x1" edc:name="T3GGO" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="nT3DONE" edc:desc="" edc:mask="0x1" edc:name="nT3DONE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T3CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="T3CON" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3ON" edc:desc="" edc:mask="0x1" edc:name="TMR3ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD16" edc:desc="" edc:mask="0x1" edc:name="RD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="nT3SYNC" edc:desc="" edc:mask="0x1" edc:name="nT3SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SOSCEN" edc:desc="" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKPS" edc:desc="" edc:mask="0x3" edc:name="T3CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR3CS" edc:desc="" edc:mask="0x3" edc:name="TMR3CS" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="T3CKPS0" edc:desc="" edc:mask="0x1" edc:name="T3CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKPS1" edc:desc="" edc:mask="0x1" edc:name="T3CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3CS0" edc:desc="" edc:mask="0x1" edc:name="TMR3CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3CS1" edc:desc="" edc:mask="0x1" edc:name="TMR3CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR3" edc:desc="" edc:name="TMR3" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR3L" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR3L" edc:desc="" edc:mask="0xff" edc:name="TMR3L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3H" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR3H" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR3H" edc:desc="" edc:mask="0xff" edc:name="TMR3H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="rrr-----" edc:cname="CMSTAT" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxx-----" edc:name="CMSTAT" edc:nzwidth="8" edc:por="xxx-----">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="CMSTATUS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="CMP1OUT" edc:desc="" edc:mask="0x1" edc:name="CMP1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP2OUT" edc:desc="" edc:mask="0x1" edc:name="CMP2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP3OUT" edc:desc="" edc:mask="0x1" edc:name="CMP3OUT" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
