balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F66K22.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR10_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR10_Prescale" edc:nmmrid="46" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR12_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR12_Prescale" edc:nmmrid="48" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:NMMRPlace>
      <edc:EmulatorZone edc:beginaddr="0xfa6" edc:endaddr="0xfc2" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly>
      <edc:GPRDataSector edc:beginaddr="0x0" edc:endaddr="0x60" edc:regionid="accessram"/>
    </edc:TraditionalModeOnly>
    <edc:ExtendedModeOnly>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x0" edc:endaddr="0x60" edc:regionid="gpre"/>
    </edc:ExtendedModeOnly>
  </edc:DataSpace>
  <edc:PinList>
    <!-- Pin 01 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="WR"/>
      <edc:VirtualPin edc:name="P2C"/>
    </edc:Pin>
    <!-- Pin 02 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="RD"/>
      <edc:VirtualPin edc:name="P2D"/>
    </edc:Pin>
    <!-- Pin 03 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RG0"/>
      <edc:VirtualPin edc:name="ECCP3"/>
      <edc:VirtualPin edc:name="P3A"/>
    </edc:Pin>
    <!-- Pin 04 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RG1"/>
      <edc:VirtualPin edc:name="TX2"/>
      <edc:VirtualPin edc:name="CK2"/>
      <edc:VirtualPin edc:name="AN19"/>
      <edc:VirtualPin edc:name="C3OUT"/>
    </edc:Pin>
    <!-- Pin 05 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RG2"/>
      <edc:VirtualPin edc:name="RX2"/>
      <edc:VirtualPin edc:name="DT2"/>
      <edc:VirtualPin edc:name="AN18"/>
      <edc:VirtualPin edc:name="C3INA"/>
    </edc:Pin>
    <!-- Pin 06 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RG3"/>
      <edc:VirtualPin edc:name="CCP4"/>
      <edc:VirtualPin edc:name="AN17"/>
      <edc:VirtualPin edc:name="P3D"/>
      <edc:VirtualPin edc:name="C3INB"/>
    </edc:Pin>
    <!-- Pin 07 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="RG5"/>
    </edc:Pin>
    <!-- Pin 08 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RG4"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="T7CKI"/>
      <edc:VirtualPin edc:name="T5G"/>
      <edc:VirtualPin edc:name="CCP5"/>
      <edc:VirtualPin edc:name="AN16"/>
      <edc:VirtualPin edc:name="P1D"/>
      <edc:VirtualPin edc:name="C3INC"/>
    </edc:Pin>
    <!-- Pin 09 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <!-- Pin 10 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <!-- Pin 11 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RF7"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="SS1"/>
    </edc:Pin>
    <!-- Pin 12 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RF6"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="C1INA"/>
    </edc:Pin>
    <!-- Pin 13 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="CVREF"/>
      <edc:VirtualPin edc:name="C1INB"/>
    </edc:Pin>
    <!-- Pin 14 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="C2INA"/>
    </edc:Pin>
    <!-- Pin 15 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="CTMUI"/>
    </edc:Pin>
    <!-- Pin 16 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RF2"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="C1OUT"/>
    </edc:Pin>
    <!-- Pin 17 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="C2OUT"/>
      <edc:VirtualPin edc:name="CTDIN"/>
    </edc:Pin>
    <!-- Pin 18 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="ENVREG"/>
    </edc:Pin>
    <!-- Pin 19 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <!-- Pin 20 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <!-- Pin 21 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="VREF+"/>
    </edc:Pin>
    <!-- Pin 22 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="VREF-"/>
    </edc:Pin>
    <!-- Pin 23 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN1"/>
    </edc:Pin>
    <!-- Pin 24 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="ULPWU"/>
    </edc:Pin>
    <!-- Pin 25 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <!-- Pin 26 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <!-- Pin 27 -->
    <edc:Pin>
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="T1CKI"/>
      <edc:VirtualPin edc:name="T3G"/>
      <edc:VirtualPin edc:name="HLVDIN"/>
    </edc:Pin>
